week 5

In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.0.3'

In [3]:
# data structure
# Series 
# dataframe

In [6]:
data = [22,33,44,55]
ds = pd.Series(data)
print(ds)

0    22
1    33
2    44
3    55
dtype: int64

In [7]:
ds[0]

22

we cannot use negative index in pandas

In [8]:
ds[-1]

KeyError: -1

In [9]:
data = [22,33,44,55]
ds = pd.Series(data,index = ['ram','shyam','hari','sita'])

In [10]:
print(ds)

ram      22
shyam    33
hari     44
sita     55
dtype: int64

you can add your own index

In [13]:
print(ds.ram)

22

In [14]:
len(ds)

4

In [15]:
ds[0] # yo garda sir ko ma warning ayo

22

In [16]:
ds.loc['ram']

22

In [17]:
ds['ram']

22

In [20]:
data = {'ram':77, 'shyam':88, 'hari':79}
ds = pd.Series(data)
print(data)
print()
print(ds)

{'ram': 77, 'shyam': 88, 'hari': 79}

ram      77
shyam    88
hari     79
dtype: int64

when you add dictionary to Series, it automatically converts the key to indexes

In [21]:
data = {'ram':77, 'shyam':88, 'hari':79}
ds = pd.Series(data, index = ['ram', 'hari'])
print(ds)

ram     77
hari    79
dtype: int64

only turns the mentioned index to series

In [24]:
ds.values, ds.index

(array([77, 79], dtype=int64), Index(['ram', 'hari'], dtype='object'))

In [25]:
print(ds.values)
print(ds.index)

[77 79]
Index(['ram', 'hari'], dtype='object')

In [26]:
import pandas as pd

In [27]:
c1 = {'ktm':10, 'brt':17, 'pkr':20}
c2 = {'ktm':30, 'brt':27, 'pkr':40}
ds1 = pd.Series(c1)
ds2 = pd.Series(c2)

print(ds1)
print()
print(ds2)

ktm    10
brt    17
pkr    20
dtype: int64

ktm    30
brt    27
pkr    40
dtype: int64

In [28]:
print(ds1 + ds2)

ktm    40
brt    44
pkr    60
dtype: int64

In [29]:
c1 = {'ktm':10, 'brt':17, 'pkr':20}
c2 = {'ktm':30, 'dharan':27, 'pkr':40}
ds1 = pd.Series(c1)
ds2 = pd.Series(c2)

print(ds1)
print()
print(ds2)

ktm    10
brt    17
pkr    20
dtype: int64

ktm       30
dharan    27
pkr       40
dtype: int64

In [30]:
print(ds1+ds2)

brt        NaN
dharan     NaN
ktm       40.0
pkr       60.0
dtype: float64

In [32]:
ds1.add(ds2)

brt        NaN
dharan     NaN
ktm       40.0
pkr       60.0
dtype: float64

In [33]:
ds1.add(ds2, fill_value = 0)

brt       17.0
dharan    27.0
ktm       40.0
pkr       60.0
dtype: float64

fill_value = 0 means replace any non-existant values with 0. in the above example, brt has no value in ds2 so the ds1 value of brt is added with 0

In [35]:
import pandas as oui

In [36]:
data = {
    'name':['ram','shyam','hari','sita'],
    'age':[22,23,33,21]
}

df = pd.DataFrame(data)
print(df)

    name  age
0    ram   22
1  shyam   23
2   hari   33
3   sita   21

In [37]:
df

    name  age
0    ram   22
1  shyam   23
2   hari   33
3   sita   21

prinr(df) nagarera df matra garda ramro dekhcha hehe

In [38]:
data = {
    'name':['ram','shyam','hari','sita'],
    'age':[22,23,33,21],
    'address':['ktm','ktm','pkr','jkp']
}

df = pd.DataFrame(data)
print(df)
print()
df

    name  age address
0    ram   22     ktm
1  shyam   23     ktm
2   hari   33     pkr
3   sita   21     jkp

    name  age address
0    ram   22     ktm
1  shyam   23     ktm
2   hari   33     pkr
3   sita   21     jkp

In [39]:
pwd

'C:\\Users\\dbeee\\Smart Data\\week5'

In [40]:
import pandas as pd

In [44]:
df = pd.read_csv('./info.csv')
df

             name  age address
0             ram   22     ktm
1        horchata   21     brt
2         prussel   19     pkr
3      aeshashoui   21     jkp
4   medammousesle   20     ktm
5           anita   15     brt
6           harry   17     pkr
7             ram   22     ktm
8        horchata   21     brt
9         prussel   19     pkr
10     aeshashoui   21     jkp
11  medammousesle   20     ktm
12          anita   15     brt
13          harry   17     pkr

In [45]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [46]:
print(df.columns)

Index(['name', 'age', 'address'], dtype='object')

In [47]:
df.age

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age, dtype: int64

In [48]:
len(df.age)

14

In [49]:
df.age

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age, dtype: int64

In [50]:
df.age.sum()

270

In [51]:
df.age.sum()/len(df)

19.285714285714285

total sum of the age column divided by the length of the dataframe

In [52]:
df.head()

            name  age address
0            ram   22     ktm
1       horchata   21     brt
2        prussel   19     pkr
3     aeshashoui   21     jkp
4  medammousesle   20     ktm

.head shows the top five rows

In [53]:
df.tail()

             name  age address
9         prussel   19     pkr
10     aeshashoui   21     jkp
11  medammousesle   20     ktm
12          anita   15     brt
13          harry   17     pkr

.tail shows the bottom 5

In [54]:
df.head(3)

       name  age address
0       ram   22     ktm
1  horchata   21     brt
2   prussel   19     pkr

top 3 elements

In [55]:
df['age']

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age, dtype: int64

In [56]:
df.age

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age, dtype: int64

In [57]:
df.age

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age, dtype: int64

In [58]:
df['age']

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age, dtype: int64

In [59]:
df.age of

SyntaxError: invalid syntax (3642483564.py, line 1)

In [63]:
df = pd.read_csv('./info.csv')
df

             name  age of address
0             ram      22     ktm
1        horchata      21     brt
2         prussel      19     pkr
3      aeshashoui      21     jkp
4   medammousesle      20     ktm
5           anita      15     brt
6           harry      17     pkr
7             ram      22     ktm
8        horchata      21     brt
9         prussel      19     pkr
10     aeshashoui      21     jkp
11  medammousesle      20     ktm
12          anita      15     brt
13          harry      17     pkr

In [64]:
df.age of

SyntaxError: invalid syntax (3642483564.py, line 1)

In [65]:
df['age of']

0     22
1     21
2     19
3     21
4     20
5     15
6     17
7     22
8     21
9     19
10    21
11    20
12    15
13    17
Name: age of, dtype: int64

In [ ]:
rerun the csv, in the csv file the heading has been changed ot 'age of' from 'age', so we need to use [] to use the